app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 141], ["LIMIT", 1]]
SELECT SUM("user_transactions"."amount") FROM "user_transactions" WHERE "user_transactions"."category_id" = $1  [["category_id", 141]]
---
  def show
    @category = Category.find(params[:id])
    @total_amount = @category.user_transactions.sum(:amount)

INSERT INTO "categories" ("name", "created_at", "updated_at", "user_id", "amount", "icon_url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test Category"], ["created_at", "2024-02-10 03:07:13.975774"], ["updated_at", "2024-02-10 03:07:13.975774"], ["user_id", 147], ["amount", nil], ["icon_url", nil]]
---
  def create
    @category = current_user.categories.build(category_params)
    attach_icon_to_category

    if @category.save