app/controllers/user_transactions_controller.rb

SELECT "user_transactions".* FROM "user_transactions" WHERE "user_transactions"."category_id" = $1 ORDER BY "user_transactions"."created_at" DESC  [["category_id", 106]]
SELECT SUM("user_transactions"."amount") FROM "user_transactions" LEFT OUTER JOIN "users" ON "users"."id" = "user_transactions"."author_id" LEFT OUTER JOIN "categories" ON "categories"."id" = "user_transactions"."category_id" WHERE "user_transactions"."category_id" = $1  [["category_id", 99]]
---
  def index
    if params[:category_id]
      @user_transactions = @category.user_transactions.order(created_at: :desc)
      @total_amount = @user_transactions.sum(:amount)
    else
      @user_transactions = current_user.categories.joins(:user_transactions).order('user_transactions.created_at DESC').select('user_transactions.*, categories.name as category_name')

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
---
  def find_category
    @category = Category.find(params[:category_id])