app/views/categories/index.html.erb

SELECT SUM("user_transactions"."amount") FROM "user_transactions" WHERE "user_transactions"."category_id" = $1  [["category_id", 71]]
---
                  </div>
                  <p class="card-text link p-text">$<%= category.user_transactions.sum(:amount) %></p>